{
	"_meta": {
		"sources": [
			{
				"json": "DragonBowBarbarian",
				"abbreviation": "WBHDBB",
				"full": "Path of the Dragon Bow Barbarian",
				"authors": [
					"Amarulence"
				],
				"convertedBy": [
					"Amarulence#5357"
				],
				"version": "1.0.0",
				"url": "darkserpent.github.io/World-Boundary-Classes/",
				"targetSchema": "1.2"
			}
		],
		"dateAdded": 1605548980,
		"dateLastModified": 1605548980
	},
	"optionalfeature": [
	],
	"subclass": [
		{
			"version": "1.0.0",
			"name": "Path of the Dragon Bow",
			"subclassTitle": "Primal Path",
			"subclassFeatures": [
				"Path of the Dragon Bow|Barbarian|PHB|Dragon Bow|WBH|3",
				"Sight of the Ancient Gods|Barbarian|PHB|Dragon Bow|WBH|6",
				"Focus the Sky|Barbarian|PHB|Dragon Bow|WBH|10",
				"Down the Desperate|Barbarian|PHB|Dragon Bow|WBH|14"
			],
			"source": "WBH",
			"shortName": "Dragon Bow",
			"className": "Barbarian",
			"classSource": "PHB"
		}
	],
	"subclassFeature": [
		{
			"name": "Path of the Dragon Bow",
			"source": "WBH",
			"className": "Barbarian",
			"classSource": "PHB",
			"subclassShortName": "Dragon Bow",
			"subclassSource": "WBH",
			"level": 3,
			"entries": [
				"An ancient art—one easily forgotten. For once, in the distant past, for every dragon of good, there were equal opposites; five for every one. The rule of dread. In those ancient times, there must have been someone to answer the call—a person to cull the strong. The Art of the Dragon Bow was developed as humanity's greatest defense against the scions of old. A warrior coated by a singular arm which would normally take up half their body weight and twice their size: the Dragon Bow. A construct forged by the flames, to defeat the flames.",
				{
					"type": "entries",
					"name": "Drosum Sroaear",
					"entries": [
						"Starting at 3rd level, the blood you have inherited from your ancestors allow you pursue the ancient art Drosum Sroaear—Dragon Slaying. In order to defeat the prodigial creatures who roam the skies, it was pertinent to create a weapon that could fell them, referred to as the Greatbow in the ancient times, or in present day: the Dragon Bow.",
						"You gain proficiency in your greatbow, which is a martial ranged weapon that deals {@dice 1d12} piercing damage with a range of 30/60 feet. It has the ammunition, heavy, and two-handed properties. The ammunition your greatbow draws from a manifestation of your internal spirit: crimson arrows created utilizing your own life force. This red-tainted ammunition appears to be made of blood, but has the consistency of cold steel. You are always considered to have these arrows prepared during combat.",
						"Once you reach 5th level, your greatbow becomes magical and grants a +1 bonus to attack and damage rolls. This bonus increases as you gain levels in this subclass, increasing to +2 at 9th level and +3 at 16th level. Finally, when you make a ranged weapon attack using your greatbow while raging, you gain a +2 to the damage roll. This bonus increases to +3 at 9th level and +4 at 16th level."
					]
				},
				{
					"type": "entries",
					"name": "Weapon of Eccentricity",
					"entries": [
						"Due to your greatbow's size, it can only be used by a Medium or larger creature that has a Strength of 18 or higher, and its ammunition cannot be modified or exchanged for magical ammunition. A creature with the Might of the Small or the Woke feat can bypass the size restriction, but that creature still must have a Strength score of 18 or higher. Finally, you can benefit from the Great Weapon Master feat with your greatbow, but not from the Sharpshooter feat."
					]
				}
			]
		},
		{
			"name": "Sight of the Ancient Gods",
			"source": "WBH",
			"className": "Barbarian",
			"classSource": "PHB",
			"subclassShortName": "Dragon Bow",
			"subclassSource": "WBH",
			"level": 6,
			"header": 2,
			"entries": [
				"Starting at 6th level, so long as you are raging, being within 5 feet of a hostile creature does not impose disadvantage on your ranged weapon attacks. In addition, when you use your Reckless Attack feature, you can apply the advantage to your greatbow."
			]
		},
		{
			"name": "Focus the Sky",
			"source": "WBH",
			"className": "Barbarian",
			"classSource": "PHB",
			"subclassShortName": "Dragon Bow",
			"subclassSource": "WBH",
			"level": 10,
			"header": 2,
			"entries": [
				"Starting at 10th level, you have mastered your heritage, truly inheriting the anicent blood which calls to you. As per the teachings of your ancestors, you have begun to manifest the traits of a dragon, allowing you to truly fight them in a space once impossible due to your limited strength.",
				"Your Brutal Critical feature now applies to ranged weapon attacks you make with your greatbow. In addition, as a bonus action while you are raging, you can increase the range of your greatbow to 60/120 until the start of your next turn."
			]
		},
		{
			"name": "Down the Desperate",
			"source": "WBH",
			"className": "Barbarian",
			"classSource": "PHB",
			"subclassShortName": "Dragon Bow",
			"subclassSource": "WBH",
			"level": 14,
			"header": 2,
			"entries": [
				"Starting at 14th level, if a creature misses you with a melee weapon attack, you can reposition yourself. As a reaction, you quickly roll to an unoccupied space within 15 feet without provoking opportunity attacks. On arrival, you click open your greatbow, immediately nocking a crimson arrow and firing as part of the same motion.",
				"If you successfully hit a creature with this special attack, your arrow explodes into a marvel of blood, knocking that creature back 5 feet and dealing an additional {@dice 1d6} force damage."
			]
		}
	]
}