{
	"_meta": {
		"sources": [{
			"json": "HornedKingBarbarian",
			"abbreviation": "WBHHKB",
			"full": "Path of the Horned King Barbarian",
			"authors": [
				"Gebri"
			],
			"convertedBy": [
				"Gebri#6820"
			],
			"version": "1.0.0",
			"url": "darkserpent.github.io/World-Boundary-Classes/",
			"targetSchema": "1.2"
		}],
		"dateAdded": 1605548980,
		"dateLastModified": 1605548980
	},
	"optionalfeature": [],
	"subclass": [{
		"version": "1.0.0",
		"name": "Path of the Horned King",
		"subclassTitle": "Primal Path",
		"subclassFeatures": [
			"Path of the Horned King|Barbarian|PHB|Horned King|WBH|3",
			"Horned King's Fervor|Barbarian|PHB|Horned King|WBH|6",
			"Strength in Bloodlust|Barbarian|PHB|Horned King|WBH|10",
			"Baleful Bull Rush|Barbarian|PHB|Horned King|WBH|14"
		],
		"source": "WBH",
		"shortName": "Horned King",
		"className": "Barbarian",
		"classSource": "PHB"
	}],
	"subclassFeature": [{
			"name": "Path of the Horned King",
			"source": "WBH",
			"className": "Barbarian",
			"classSource": "PHB",
			"subclassShortName": "Horned King",
			"subclassSource": "WBH",
			"level": 3,
			"entries": [
				"Since ancient days, men have gathered to honor the gods of the hunt—but every so often, one of these cults is truly devoted to Baphomet, the Horned King, the father of minotaurs. Those that knowingly and willingly beseech the demon prince’s favor are endowed with ebon horns and a violent temper, making them little more than beasts hiding beneath a man’s flesh.",
				{
					"type": "entries",
					"name": "Ebon Horns",
					"entries": [
						"Starting at 3rd level, when you choose this primal path, you undergo an abominable transformation as part of the ritual of the Horned King. From your skull grows a pair of black horns, allowing you to use them as unarmed strikes and melee weapon attacks. When you hit a target with your horns, you deal piercing damage equal to {@dice 1d10} + your Strength modifier. When you reach 10th level in this class, this damage die increases to {@dice 1d12}.",
						"If you already have horns as part of your race, you can choose whether to use the statistics of your race’s horns or the horns provided by this subclass."
					]
				},
				{
					"type": "entries",
					"name": "Run of the Bull",
					"entries": [
						"Also at 3rd level, bloodlust seizes you. You can take the {@action Dash} action as a bonus action while raging. Additionally, whenever you move at least 20 feet in a straight line toward a target and hit it with your horns on the same turn, the target takes additional damage equal to your Strength modifier."
					]
				}
			]
		},
		{
			"name": "Horned King's Fervor",
			"source": "WBH",
			"className": "Barbarian",
			"classSource": "PHB",
			"subclassShortName": "Horned King",
			"subclassSource": "WBH",
			"level": 6,
			"header": 2,
			"entries": [
				"Starting at 6th level, attacks made with your horns count as magical for the purposes of overcoming resistance and immunity to non-magical attacks."
			]
		},
		{
			"type": "entries",
			"name": "Beast of the Labyrinth",
			"entries": [
				"Those that devote themselves to the Horned King or give into his rituals become beasts among men—and no true predator ever gets lost. Starting at 6th level, you can perfectly recall any path you have traveled.",
				"Additionally, you can psychically track prey. As a free action once per turn, you can designate one creature you can see as your prey. For the next 10 minutes, you can use another action to learn the current distance and direction to the target if it is on the same plane of existence (but not necessarily the shortest or safest route). You must concentrate to maintain this connection, as if concentrating on a spell. You can only have one designated prey creature at a time."
			]
		},
		{
			"name": "Strength in Bloodlust",
			"source": "WBH",
			"className": "Barbarian",
			"classSource": "PHB",
			"subclassShortName": "Horned King",
			"subclassSource": "WBH",
			"level": 10,
			"header": 2,
			"entries": [
				"At 10th level, your descent into bloodlust quickens, lending you strength. When you hit a creature with your horns while you’re raging, you can deal extra damage equal to your proficiency bonus."
			]
		},
		{
			"name": "Baleful Bull Rush",
			"source": "WBH",
			"className": "Barbarian",
			"classSource": "PHB",
			"subclassShortName": "Horned King",
			"subclassSource": "WBH",
			"level": 14,
			"header": 2,
			"entries": [
				"When you charge forward, it is with the malice of the Horned King himself, allowing you to slip through planes of existence in a burst of speed.",
				"At 14th level, when you take the Dash action while raging and can see your prey (as per the Beast of the Labyrinth feature), you enter the Border Ethereal until you’ve reached your target, stopped moving toward your target, or have used all of your movement speed.",
				"While on the Ethereal Plane, you can see and hear the plane you originated from, which is cast in shades of gray. You can’t see anything more than 60 feet into that plane, and you can only affect and be affected by other creatures on the Ethereal Plane. Creatures that aren’t there can’t perceive you or interact with you, unless they have the ability to do so.",
				"If you emerge from the Ethereal Plane within 10 feet of your quarry after using this feature, your attacks against the creature on this turn deal an additional {@dice 1d12} damage."
			]
		}
	]
}